Autodesk.Revit.DB.DirectShapeLibrary.ContainsType(System.String)
A quick check whether a definition type already exists in the library. Checks for type objects only.
name:
Definition id
Returns:
True if a geometry definition exists, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.Contains(System.String)
A quick check whether a definition already exists in the library. Checks for stored geometry objects only.
id:
Definition id
Returns:
True if a geometry definition exists, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.FindDefinitionType(System.String)
Find a DirectShapeType element by definition id. The element will be used for creating instances of that definition.
id:
Definition id. Expected to be unique.
Returns:
Element id of a DirectShapeTypeElement
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.FindDefinition(System.String)
Find a definition by id
id:
Definition id. Expecected to be unique
Returns:
List of geometry objects that together define a shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.AddDefinitionType(System.String,Autodesk.Revit.DB.ElementId)
Add a definition to be reused by instances. Adding a definition type will change how the instances are created.
When asked to create a definition, the library object will look for a corresponding type object.
If one is found, it will create an instance of geometry stored in the type object. If it is not found,
the library will look for a list of geometry objects stored as definition, and will copy and transform these
to create an instance.
id:
ID of the definition to be added. Must be unique.
typeId:
Element id of the DirectShapeType element that will be used as a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.AddDefinition(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Add a definition to be reused by instances. A definition is a collection of geometry objects.
id:
ID of the definition to be added. Must be unique.
GNodes:
Definition as a list of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.AddDefinition(System.String,Autodesk.Revit.DB.GeometryObject)
Add a definition to be reused by instances. A definition is a single geometry object.
id:
ID of the definition to be added. Must be unique.
GNode:
Definition as a single Geometry object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.DirectShapeLibrary.GetDirectShapeLibrary(Autodesk.Revit.DB.Document)
Get the currently active Library object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015